alenly445/esp32-camera-line-following/esp32_uvc_test/sdkconfig.defaults
# ESP32-S3, 与小车主板一致：16MB Flash + Octal PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
# JQ-CAM12 是 UVC+UAC 复合设备，配置描述符超过默认 256（实测 >512），给到 2048
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048
# 串口日志走 UART0 -> 板载 CP210x (COM7)，115200
